[
  "Did you know that a group of Jays is called a party?",
  "Blue Jays are masters of deception! They've been observed to mimic the calls of hawks to fool other birds.",
  "A Blue Jay's feathers are not actually blue! They appear blue due to light refraction and the structure of their feathers.",
  "Blue Jays are very good at cracking nuts. They have even been observed using vehicles to crack open acorns!",
  "Ever seen a bald Blue Jay? Don't worry, they're not sick! They shed and regrow their head feathers all at once.",
  "You may think they're just goofing around, but when Blue Jays bob their heads, they're actually getting a better sense of depth perception.",
  "While Blue Jays love to eat insects, nuts, and seeds, they've also been known to indulge in picnic scraps. Watch your sandwiches!",
  "Blue Jays are natural forest planters! They often forget where they've hidden their acorns, helping grow new trees.",
  "Some people think Blue Jays are a little vain, because they're often spotted admiring themselves in reflective surfaces.",
  "Blue Jays are excellent architects. Their nests are complex structures made from twigs, grass, bark, and sometimes even tinsel and paper.",
  "Contrary to popular belief, Blue Jays don't just tweet – they can make a wide range of sounds, including whistles, clicks and even 'liquid' notes.",
  "Despite being quite social, Blue Jays love a little privacy while nesting, often choosing spots deep within shrubs or trees.",
  "Blue Jays' favorite game to play at parties? It's called 'pass the acorn'. They've been seen passing acorns from their beak to their food storage compartment, over and over!",
  "Ever wonder why you rarely see Blue Jays in the winter? They're still there! They just swap their bright blue for more incognito winter plumage.",
  "Ever been woken up by a Blue Jay's call? You're not alone. They're known for their noisy nature and are especially vocal when predators are around.",
  "Blue Jays are surprisingly tidy eaters. They've been observed washing their food in a bird bath before eating it!",
  "Blue Jays are clever and have good memories. Once they’ve visited a bird feeder, they won’t forget it and will come back again and again.",
  "Just like us, Blue Jays enjoy a variety in their diet and they are not shy about trying out new food items from bird feeders.",
  "Blue Jays are quite the jet-setters. They can migrate one year, then decide not to migrate the next. They're as unpredictable as they are charming!",
  "Blue Jays have been found to live for more than 17 years. That's quite a lot of parties they've been to!"
]
